/* -------------------------------------------------------------------------- */
/* avr.cpp																	  */
/* CL21																		  */
/*																			  */
/* -------------------------------------------------------------------------- */
/* 番号		更新履歴							日付		氏名			  */
/* -------------------------------------------------------------------------- */
/* 000000	新規作成							2016/06/30	田中 翔吾		  */
/* -------------------------------------------------------------------------- */
#include "avr.h"

/* -------------------------------------------------------------------------- */
/* 関数名		: delay_ms													  */
/* 機能名		: ディレイ(ms)												  */
/* 機能概要		: 引数で渡された時間(ms)待機する							  */
/* 引数			: SINT			: ms		: 待機時間(ms)					  */
/* 戻り値		: なし														  */
/* 作成日		: 2016/06/14	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
void delay_ms( SINT ms )
{
	if( ms != 0){
		while( ms-- ){
			_delay_ms( 1 );
		}
	}
}

/* -------------------------------------------------------------------------- */
/* 関数名		: delay_us													  */
/* 機能名		: ディレイ(μs)												  */
/* 機能概要		: 引数で渡された時間(μs)待機する							  */
/* 引数			: SINT			: ms		: 待機時間(μs)					  */
/* 戻り値		: なし														  */
/* 作成日		: 2016/06/14	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
void delay_us( SINT us )
{
	us /= 10;
	if( us != 0 ){
		while( us-- ){
			_delay_us( 10 );
		}
	}
}

/* -------------------------------------------------------------------------- */
/* 関数名		: GetRegState												  */
/* 機能名		: レジスタ状態取得											  */
/* 機能概要		: レジスタの任意ビットの状態を取得する			 			  */
/* 引数			: volatile	UCHR	: reg		: レジスタ					  */
/*				: 			UCHR	: bitno		: ビット番号				  */
/* 戻り値		: 			UCHR	: LOW		: 0(Low)					  */
/* 				: 			UCHR	: HIGH		: 1(High)					  */
/* 作成日		: 2016/06/29	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
UCHR GetRegState( volatile UCHR reg, UCHR bitno )
{
	/* ---------------------------------------------------------------------- */
	/* 変数定義      												  	      */
	/* ---------------------------------------------------------------------- */
	UCHR	cState	= LOW;						/* 状態						  */

	/* ---------------------------------------------------------------------- */
	/* メイン処理     												  	      */
	/* ---------------------------------------------------------------------- */
	cState = reg & ( 1 << bitno );
	cState >>= bitno;
		
	return cState;
}	

/* A/D変換関連関数 ---------------------------------------------------------- */
/* -------------------------------------------------------------------------- */
/* 関数名		: SetADC													  */
/* 機能名		: A/D変換設定												  */
/* 機能概要		: A/D変換の設定を行う										  */
/* 引数			: volatile	UCHR*	: ddrx		: ポート方向レジスタ(DDRx)	  */
/* 				: volatile	UCHR*	: pinx		: ポート入力レジスタ(PINx)	  */
/* 				: 			UCHR	: bitno		: ビット番号				  */
/* 戻り値		: なし														  */
/* 作成日		: 2016/06/29	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
void SetADC( volatile UCHR* ddrx, volatile UCHR* pinx, UCHR bitno )
{
	/* 入力設定 */
	Low( *ddrx, bitno );						/* [I N]	 				  */
	High( *pinx, bitno );
	
	/* ADMUX設定 */
	Low( ADMUX, REFS1 );						/* 基準電圧(5V)				  */
	High( ADMUX, REFS0 );						/* 基準電圧(5V)				  */
	Low( ADMUX, ADLAR );						/* A/D変換結果右揃え		  */
	ADMUX |= bitno;								/* 入力チャネル				  */
	
	/* ADCSRA設定 */
	High( ADCSRA, ADEN );						/* A/D変換許可				  */
	 							
}

/* -------------------------------------------------------------------------- */
/* 関数名		: GetADC													  */
/* 機能名		: A/D変換値取得												  */
/* 機能概要		: A/D変換し、結果を返す。									  */
/* 引数			: なし														  */
/* 戻り値		: USHT			: sValue	: A/D変換値						  */
/* 作成日		: 2016/06/29	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
USHT GetADC( void )
{
	/* ---------------------------------------------------------------------- */
	/* 変数宣言		      												      */
	/* ---------------------------------------------------------------------- */
	SSHT sValue = 0;							/* A/D変換値				  */
	
	/* ---------------------------------------------------------------------- */
	/* A／D変換		      												      */
	/* ---------------------------------------------------------------------- */
	High( ADCSRA, ADSC );						/* A/D変換開始				  */
	
	/* 変換終了まで待機 ----------------------------------------------------- */
	while ( GetRegState( ADCSRA, ADSC ) == HIGH );
	
	delay_ms( 10 );								/* 変換安定待ち				  */
		
	sValue = ADC & ADC_MSK;						/* A/D変換値取得			  */
	
	return sValue;
}

/* -------------------------------------------------------------------------- */
/* 関数名		: SetTimerInterrupt											  */
/* 機能名		: タイマ割込み設定											  */
/* 機能概要		: タイマ割込みのレジスタ設定を行う。						  */
/* 引数			: DBLE			: ms		: 割込み間隔(ms)				  */
/* 戻り値		: なし														  */
/* 作成日		: 2016/09/07	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
void SetTimerInterrupt( DBLE ms )
{
	/* Timer値設定 */
	OCR1A = ( USHT )( ( ms / 1000 ) * ( F_CPU / 64 ) - 1);
	
	/* 割込み設定 */
	High( TCCR1B, WGM12 );						/* CTCモード(Count_Up)		  */
	High( TIMSK1, OCIE1A );						/* 比較一致モード割込みを許可 */
	
	/* 割込み開始 */
	High( TCCR1B, CS11 );						
	High( TCCR1B, CS10 );					
	sei();

}

/* -------------------------------------------------------------------------- */
/* 関数名		: SetExternalInterrupt										  */
/* 機能名		: 外部割込み設定(両エッジ)									  */
/* 機能概要		: 外部割込みのレジスタ設定を行う。							  */
/* 引数			: enum PORT		: port			: ポート		 			  */
/* 				: UCHR			: bitno			: ビット番号				  *//* 戻り値		: なし														  */
/* 作成日		: 2016/09/07	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
void SetExternalInterrupt( enum PORT port, UCHR bitno )
{
	switch( port ){
		case B_PORT:
			High( PCICR, PCIE0 );
			High( PCMSK0, bitno );
			break;
		case C_PORT:
			High( PCICR, PCIE1 );
			High( PCMSK1, bitno );
			break;
		case D_PORT:	 
			High( PCICR, PCIE2 );
			High( PCMSK2, bitno );
			break;
		default:
			break;
	}
	
	/* 割込み許可 */			
	sei();
	
}

/* -------------------------------------------------------------------------- */
/* 				Copyright HAL College of Technology & Design				  */
/* -------------------------------------------------------------------------- */
