/* -------------------------------------------------------------------------- */
/* lcd.h																	  */
/*																			  */
/*																			  */
/* -------------------------------------------------------------------------- */
/* 番号		更新履歴							日付		氏名			  */
/* -------------------------------------------------------------------------- */
/* 000000	新規作成							2016/10/26	田中 翔吾		  */
/* -------------------------------------------------------------------------- */
#ifndef LCD_LIBRARY_
#define LCD_LIBRARY_

/* -------------------------------------------------------------------------- */
/* includeファイル	    												  	  */
/* -------------------------------------------------------------------------- */
#include <avr/pgmspace.h>
#include "avr.h"								/* AVRライブラリ			  */
#include "LCD_Library_Font.h"					/* 文字フォントデータ(8x5)	  */

/* -------------------------------------------------------------------------- */
/* typedef定義																  */
/* -------------------------------------------------------------------------- */
#ifndef _TYPEDEF
#define _TYPEDEF
typedef 		 char	SCHR;					/* char型					  */
typedef unsigned char	UCHR;					/* unsigned char型			  */
typedef 		 short	SSHT;					/* short型					  */
typedef unsigned short	USHT;					/* unsigned short型			  */
typedef 		 long	SLNG;					/* long型					  */
typedef unsigned long	ULNG;					/* unsigned long型			  */
typedef 		 int	SINT;					/* int型					  */
typedef unsigned int	UINT;					/* unsigned int型			  */
typedef			 double	DBLE;					/* double型					  */
#endif

/* -------------------------------------------------------------------------- */
/* 定数・マクロ定義															  */
/* -------------------------------------------------------------------------- */
/* Mapping LCD<->AVR */
#define LCD_RS			PORT_A3					/* LCD4	L:Data/H:Code		  */
#define LCD_RW			PORT_A2					/* LCD5	L:Write/H:Read		  */
#define	LCD_E			PORT_A4					/* LCD6	Enable				  */

#define LCD_DB0			PORT_D8 				/* LCD7						  */
#define LCD_DB1			PORT_D9     			/* LCD8						  */
#define LCD_DB2			PORT_D10   				/* LCD9						  */
#define LCD_DB3			PORT_D11				/* LCD10					  */
#define LCD_DB4			PORT_D4     			/* LCD11					  */
#define LCD_DB5			PORT_D5     			/* LCD12					  */
#define LCD_DB6			PORT_D6					/* LCD13					  */
#define LCD_DB7			PORT_D7     			/* LCD14					  */
                                
#define LCD_CS1			PORT_A0					/* LCD15(IC1)				  */
#define LCD_CS2			PORT_A1					/* LCD16(IC2)				  */

#define LCD_LEFT		( 0 )					/* 画面1(CS1)				  */
#define LCD_RIGHT		( 1	)					/* 画面2(CS2)				  */

#define _ALIGN_LEFT_	( 0 )					/* 左揃え					  */
#define _ALIGN_CENTER_	( 1 )					/* 中央揃え					  */
#define _ALIGN_RIGHT_	( 2 )					/* 右揃え					  */

#define _NORMAL_		( 0 )					/* 通常表示					  */
#define _REVERSAL_		( 1 )					/* 反転表示					  */

/* -------------------------------------------------------------------------- */
/* プロトタイプ宣言															  */
/* -------------------------------------------------------------------------- */

/* -------------------------------------------------------------------------- */
/* 関数名		: InitLCD													  */
/* 機能名		: LCD初期化													  */
/* 機能概要		: LCDのポートの初期設定を行う。								  */
/* 引数			: なし														  */
/* 戻り値		: なし														  */
/* 作成日		: 2016/10/26	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
void InitLCD( void );						

/* -------------------------------------------------------------------------- */
/* 関数名		: ClearLCD													  */
/* 機能名		: LCDクリア													  */
/* 機能概要		: LCDの表示をクリア(消去)する。								  */
/* 引数			: なし														  */
/* 戻り値		: なし														  */
/* 作成日		: 2016/10/26	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
void ClearLCD( void );							

/* -------------------------------------------------------------------------- */
/* 関数名		: WriteCommand												  */
/* 機能名		: コマンド書き込み											  */
/* 機能概要		: LCDにコマンドを書き込む。									  */
/* 引数			: SCHR			: command		: コマンド(1byte)			  */
/* 戻り値		: なし														  */
/* 作成日		: 2016/10/26	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
void WriteCommand( SCHR command );				

/* -------------------------------------------------------------------------- */
/* 関数名		: WriteData													  */
/* 機能名		: データ書き込み											  */
/* 機能概要		: LCDにデータを書き込む。									  */
/* 引数			: SCHR			: data			: データ(1byte)				  */
/* 戻り値		: なし														  */
/* 作成日		: 2016/10/26	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
void WriteData( SCHR data );					

/* -------------------------------------------------------------------------- */
/* 関数名		: EnableLCD													  */
/* 機能名		: 書き込み実行												  */
/* 機能概要		: LCDへの書き込みを実行する。								  */
/* 引数			: なし														  */
/* 戻り値		: なし														  */
/* 作成日		: 2016/10/26	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
void EnableLCD( void );						

/* -------------------------------------------------------------------------- */
/* 関数名		: SetDataBus												  */
/* 機能名		: データ振り分け											  */
/* 機能概要		: LCDの各データバスに値を設定する。							  */
/* 引数			: SCHR			: data			: データ(1byte)				  */
/* 戻り値		: なし														  */
/* 作成日		: 2016/10/26	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
void SetDataBus( SCHR data );					

/* -------------------------------------------------------------------------- */
/* 関数名		: SelectScreen												  */
/* 機能名		: 画面選択													  */
/* 機能概要		: 使用するLCDの画面(CS1/CS2)を選択する。					  */
/* 引数			: SCHR			: lr			: LCD_LEFT (画面1)			  */
/* 				:				:				: LCD_RIGHT(画面2)		 	  */
/* 戻り値		: なし														  */
/* 作成日		: 2016/10/26	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
void SelectScreen( SCHR lr );					

/* -------------------------------------------------------------------------- */
/* 関数名		: WriteLCD													  */
/* 機能名		: LCD表示													  */
/* 機能概要		: 指定した位置にデータを表示する。							  */
/* 引数			: SCHR			: row			: 行(0～7)					  */
/* 				: SCHR			: col			: 列(0～127)				  */
/* 				: SCHR			: data			: データ(1byte)				  */
/* 戻り値		: なし														  */
/* 作成日		: 2016/10/26	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
void WriteLCD( SCHR row, SCHR col, SCHR data );	

/* -------------------------------------------------------------------------- */
/* 関数名		: WriteChar													  */
/* 機能名		: 文字表示													  */
/* 機能概要		: 指定した位置に文字(1文字)を表示する。						  */
/* 引数			: 		SCHR	 : row			: 行(0～7)					  */
/* 				: 		SCHR	 : col			: 列(0～15)					  */
/* 				: const SCHR	 : chr			: 文字(半角)				  */
/* 戻り値		: なし														  */
/* 作成日		: 2016/10/26	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
void WriteChar( SCHR row, SCHR col, const SCHR chr );

/* -------------------------------------------------------------------------- */
/* 関数名		: WriteString												  */
/* 機能名		: 文字列表示												  */
/* 機能概要		: 指定した位置から文字列(MAX16文字)を表示する。				  */
/* 引数			: 		SCHR	 : row			: 行(0～7)					  */
/* 				: 		SCHR 	 : col			: 列(0～15)					  */
/* 				: const SCHR*	 : str			: 文字列(半角)				  */
/* 戻り値		: なし														  */
/* 作成日		: 2016/10/26	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
void WriteString( SCHR row, SCHR col, const SCHR* str );	

/* -------------------------------------------------------------------------- */
/* 関数名		: WriteAlignString											  */
/* 機能名		: 文字列表示												  */
/* 機能概要		: 指定した行に指定した位置揃えで文字列(MAX16文字)を表示する。 */
/* 引数			: 		SCHR	 : row			: 行(0～7)					  */
/* 				: const SCHR*	 : str			: 文字列(半角)				  */
/* 				: 		SCHR	 : align		: 位置揃え					  */
/*				:				 :				:  _LEFT_ALIGN_   (左揃え)	  */
/*				:				 :				:  _CENTER_ALIGN_ (中央揃え)  */
/*				:				 :				:  _RIGHT_ALIGN_  (右揃え)	  */
/* 戻り値		: なし														  */
/* 作成日		: 2016/10/26	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
void WriteAlignString( SCHR row, const SCHR* str, SCHR align );	

/* -------------------------------------------------------------------------- */
/* 関数名		: DrawBMP													  */
/* 機能名		: BMP画像表示												  */
/* 機能概要		: LCDにモノクロBMP画像(64x128)を表示する					  */
/* 引数			: const uint8_t* : bmp			: BMP画像					  */
/* 				: 		UCHR	 : mode			: 表示モード				  */
/*				:				 :				:  _NORMAL_   (通常表示)	  */
/*				:				 :				:  _REVERSE_  (反転表示)	  */
/* 戻り値		: なし														  */
/* 作成日		: 2016/10/26	田中 翔吾									  */
/* -------------------------------------------------------------------------- */
void DrawBMP( const uint8_t* bmp, UCHR mode );				

#endif