/* -------------------------------------------------------------------------- */
/* music.h																	  */
/* CL21																		  */
/*																			  */
/* -------------------------------------------------------------------------- */
/* 番号		更新履歴							日付		氏名			  */
/* -------------------------------------------------------------------------- */
/* 000000	新規作成							2016/07/07	田中 翔吾		  */
/* -------------------------------------------------------------------------- */

#ifndef _MUSIC_H
#define _MUSIC_H

/* -------------------------------------------------------------------------- */
/* 音名定義			      												      */
/* -------------------------------------------------------------------------- */
#define	C3		(  0 )							/* 低音ド					  */
#define	Cs3		(  1 )							/* 低音ド♯					  */
#define	Df3		(  1 )							/* 低音レ♭					  */
#define	D3		(  2 )							/* 低音レ					  */
#define	Ds3		(  3 )							/* 低音レ♯					  */
#define	Ef3		(  3 )							/* 低音ミ♭					  */
#define	E3		(  4 )							/* 低音ミ					  */
#define	F3		(  5 )							/* 低音ファ					  */
#define	Fs3		(  6 )							/* 低音ファ♯				  */
#define	Gf3		(  6 )							/* 低音ソ♭					  */
#define	G3		(  7 )							/* 低音ソ					  */
#define	Gs3		(  8 )							/* 低音ソ♯					  */
#define	Af4		(  8 )							/* 低音ラ♭					  */
#define	A4		(  9 )							/* 低音ラ					  */
#define	As4		( 10 )							/* 低音ラ♯					  */
#define	Bf4		( 10 )							/* 低音シ♭					  */
#define	B4		( 11 )							/* 低音シ					  */

#define	C4		( 12 )							/* 標準ド					  */
#define	Cs4		( 13 )							/* 標準ド♯					  */
#define	Df4		( 13 )							/* 標準レ♭					  */
#define	D4		( 14 )							/* 標準レ					  */
#define	Ds4		( 15 )							/* 標準レ♯					  */
#define	Ef4		( 15 )							/* 標準ミ♭					  */
#define	E4		( 16 )							/* 標準ミ					  */
#define	F4		( 17 )							/* 標準ファ					  */
#define	Fs4		( 18 )							/* 標準ファ♯				  */
#define	Gf4		( 18 )							/* 標準ソ♭					  */
#define	G4		( 19 )							/* 標準ソ					  */
#define	Gs4		( 20 )							/* 標準ソ♯					  */
#define	Af5		( 20 )							/* 標準ラ♭					  */
#define	A5		( 21 )							/* 標準ラ					  */
#define	As5		( 22 )							/* 標準ラ♯					  */
#define	Bf5		( 22 )							/* 標準シ♭					  */
#define	B5		( 23 )							/* 標準シ					  */

#define	C5		( 24 )							/* 高音ド					  */
#define	Cs5		( 25 )							/* 高音ド♯					  */
#define	Df5		( 25 )							/* 高音レ♭					  */
#define	D5		( 26 )							/* 高音レ					  */
#define	Ds5		( 27 )							/* 高音レ♯					  */
#define	Ef5		( 27 )							/* 高音ミ♭					  */
#define	E5		( 28 )							/* 高音ミ					  */
#define	F5		( 29 )							/* 高音ファ					  */
#define	Fs5		( 30 )							/* 高音ファ♯				  */
#define	Gf5		( 30 )							/* 高音ソ♭					  */
#define	G5		( 31 )							/* 高音ソ					  */
#define	Gs5		( 32 )							/* 高音ソ♯					  */
#define	Af6		( 32 )							/* 高音ラ♭					  */
#define	A6		( 33 )							/* 高音ラ					  */
#define	As6		( 34 )							/* 高音ラ♯					  */
#define	Bf6		( 34 )							/* 高音シ♭					  */
#define	B6		( 35 )							/* 高音シ					  */

#define	C6		( 36 )							/* 高高音ド					  */

#define FIN		( 99 )							/* 曲終了					  */

/* -------------------------------------------------------------------------- */
/* 音階周波数定義(Hz)      												      */
/* -------------------------------------------------------------------------- */
const float Heltz[] = {
	/* 低音 */
	130.81, 
	138.59, 
	146.83, 
	155.56, 
	164.81, 
	174.61, 
	184.99, 
	195.99, 
	207.65, 
	220.00, 
	233.08, 
	246.94, 
	/* 標準 */ 
	261.62, 
	277.18, 
	293.66, 
	311.12, 
	329.62, 
	349.22, 
	369.99, 
	391.99, 
	415.30, 
	440.00, 
	466.16, 
	493.88, 
	/* 高音・高高音 */ 
	523.25, 
	554.36, 
	587.32, 
	622.25, 
	659.25, 
	698.45, 
	739.98, 
	783.99, 
	830.60, 
	880.00, 
	932.32, 
	987.76, 
	1046.50
}; 

#endif /* MUSIC_H_ */